---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairTooManyConnectedBoundariesError
source: html/ac401790-2f16-eeaa-198c-b4d31e995e22.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairTooManyConnectedBoundariesError Property

Stairs require no more than two boundaries (chains of one or more Boundary Lines).

## Syntax (C#)
```csharp
public static FailureDefinitionId StairTooManyConnectedBoundariesError { get; }
```